app/controllers/category_controller.rb

SELECT `categories`.* FROM `categories`
---
    def index
        category = Category.all

INSERT INTO `categories` (`category_name`, `description`, `created_at`, `updated_at`) VALUES ('Tas', 'Tas terbuat dari kulit manusia', '2018-03-07 06:54:23', '2018-03-07 06:54:23')
---
    def create
        @category = Category.new(category_name: params[:category_name],description: params[:description])

        if @category.save