app/controllers/product_controller.rb

  def index
        product = Product.all
---
SELECT `products`.* FROM `products`

  def create
		@product = Product.new(name: params[:name], description: params[:description])
		if @product.save
---
INSERT INTO `products` (`name`, `description`, `created_at`, `updated_at`) VALUES ('Resep', 'Buku resep', '2018-03-07 06:34:53', '2018-03-07 06:34:53')

  def update
        @product = Product.find(params[:id])
        if @product.update_attribute(:name, params[:name])
---
SELECT  `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1
UPDATE `products` SET `name` = NULL, `updated_at` = '2018-03-13 08:42:32' WHERE `products`.`id` = 1

  def destroy
        @product = Product.find(params[:id])
        if @product.destroy
---
SELECT  `products`.* FROM `products` WHERE `products`.`id` = 0  ORDER BY `products`.`id` ASC LIMIT 1
DELETE FROM `products` WHERE `products`.`id` = 5